[
  {
    "title": "Public Programs",
    "image": "https://www.bmc.net/assets/images/public_programs.jpg",
    "description": "\n\nBMC Training Programs have been developed and are continually updated, based not only on the latest international Management principles and practices, but also on field research, first-hand experience, in-depth knowledge of the region and the specific requirements of organizations. Public training Programs are open to participants from any organization. These participants have the opportunity to concentrate on their learning away from the job and without the pressures of day-to-day work. Participants also benefit from sharing experiences with people from other organizations and gain a new perspective on common problems.\nPublic training Programs are open to participants from any organization. These participants have the opportunity to concentrate on their learning away from the job and without the pressures of day-to-day work. Participants also benefit from sharing experiences with people from other organizations and gain a new perspective on common problems. BMC relies on a variety of training and facilitation methods and techniques. Used whenever applicable, these methods are aimed at enhancing individual and group interaction while maximizing learning. Some of these methods are:\n\nTo ensure the concepts and skills introduced in our Programs are duly transferred to the workplace, BMC is ready to incorporate an \"action plan\" section at the end of any training program. This section will constitute an integral part of the training and will be completed by the participants before the closing of the program.",
    "listItems": [
      "Brief presentations by the consultant.",
      "Group debriefs.",
      "Individual and team exercises, indoors and outdoors.",
      "Behavior modeling and role-plays.",
      "One-to-one and group discussions.",
      "Case studies, simulations and small projects.",
      "Individual action plans (to follow up and evaluate training results)."
    ]
  },
  {
    "title": "Customised Training",
    "image": "https://www.bmc.net/assets/images/customised_training.jpg",
    "description": "\n\nBMC believes that the training and development of people at work creates focus to achieve incredible results.Our dynamic and highly experienced trainers deliver a broad spectrum of courses using innovative training styles, such as accelerated learning techniques to stimulate delegates.BMC realises that if the learning experience is enjoyable and relevant they will remember their new skills and be able to recall them when they are really needed.\nOur aim is to create fun learning that inspires delegates. BMC Center offer a dynamic new experience in training. We are flexible, approachable, professional and friendly. We are able to offer a service that is second to none, with a dedicated team of advisors answering any queries and highly experienced trainers who pride themselves on their innovative training style.\nBMC is based on the belief that our customers' needs are of the utmost importance. Our entire team is committed to meeting those needs. As a result, a high percentage of our business is from repeat customers and referrals.\nCustomised Training Programs represent concentrated, practical, one-to-one coaching sessions, with individuals receiving the full-time attention of specialized and experienced consultants. BMC has conducted many such in-depth training Programs , which were specifically designed for individual participants. The subjects covered were based on the specific needs of each participant. The Programs usually comprise briefings by BMC Senior Consultants, reviews of manuals, reports and other data, as well as supervised exercises and structured discussions.",
    "listItems": []
  },
  {
    "title": "Research",
    "image": "https://www.bmc.net/images/research.jpg",
    "description": "\n\nThe research carried out by BMC focuses on studies related to Management in the World. Much of our research is conducted with practicing managers and executives whose involvement helps in shaping and supporting particular studies.\nIt is not possible to predict what the future holds but the more knowledge you gain in understanding the dynamics, probabilities and trends, the more likely that your decisions will result in a favourable outcome.\nWhether identifying opportunities, maximising resources or minimising risk, BMC provides comprehensive advice with solid solutions from concept to completion.\nOur research synthesizes international Management literature by significant thinkers, scholars and practitioners world-wide. The authors tackle five related questions:\n",
    "listItems": [
      "What influence do early childhood years have on leadership development and success?",
      "What are the specific life experiences that contribute to leadership success?",
      "How do leaders with potential become outstanding?",
      "What critical paths must leaders follow on their journey to success?",
      "What must great leaders do exceptionally well to become and remain outstanding?"
    ]
  },
  {
    "title": "Consulting",
    "image": "https://www.bmc.net/assets/images/consulting.jpg",
    "description": "\n\nWe provide independent advice on complex business problems at senior levels in the public and private sectors. We take a hands-on role to ensure solutions are not only conceived, but also delivered with genuine benefits. Within our consultancy, we support our clients by cutting through complexity to deliver results. We plan, design and deliver solutions that result in real value through releasing potential efficiency gains from the implementation of organisational and ICT enabled business change.\nOur consultants ensure that business cases are developed to obtain management commitment and approval for investment in business change including programmes and projects. We design and redesign existing organisations to enhance capability or to introduce new ways of working in a way that is coherent with your organisation’s direction and goals.\nWe know that turning your corporate vision and strategy into operational reality can be challenging and disruptive to business as usual. So we provide direction, guidance and innovative services to support and enable the successful execution of change initiatives. Our experienced consultants guide and support you through strategic based analysis to develop and implement the entire business portfolio, prioritising which projects and programmes will achieve most business benefit.\nOur ICT consultants ensure that any technology not only meets the requirements of its users but that it is implemented and managed to realise the promised benefits. We provide programme and project management consultancy and even entire programme management teams to assist our clients to deliver controlled change to transform their business.\nWe focus on the provision of client side project management expertise to ensure that our client’s project objectives aren’t just conceived, they are actually successfully delivered within the ever present constraints of time, cost and quality.",
    "listItems": []
  },
  {
    "title": "In-House Training",
    "image": "https://www.bmc.net/assets/images/in-house-training.jpg",
    "description": "\n\nIn addition to our scheduled professional training programmes and seminars, BMC, has produced hundreds of In-House Courses. These In-House Courses accommodate your needs when groups of professionals require training. Whatever the topic, we can fulfill your training needs.\nMost of the training Courses described in this category can be offered \"in-House Training\" in English or Arabic and are then designed to effectively and economically meet the specific needs of the client. BMC can also design and offer \"in-House Training\" Courses and Seminars on subjects that are not listed in this directory.\n\nin-House Training benefit the client because they:\n",
    "listItems": [
      "Include specially designed cases and exercises, which apply to the client's situation.",
      "Address issues specifically related to the organization.",
      "Are cost effective.",
      "Build team spirit among the program participants.",
      "Enable the organization to select the proper mix of participants to ensure maximum benefit."
    ]
  }
]